openfoam_templates/microchannel/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform __INLET_TEMP__;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    fluidInlet
    {
        type            fixedValue;
        value           uniform __INLET_TEMP__;
    }
    fluidOutlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    fluidWalls
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
        type            coupledTemperature;
        value           $internalField;
    }
}

// ************************************************************************* //
