openfoam_templates/microchannel/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (__INLET_VELOCITY__ 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    fluidInlet
    {
        type            fixedValue;
        value           uniform (__INLET_VELOCITY__ 0 0);
    }
    fluidOutlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    fluidWalls
    {
        type            noSlip;
    }
    fluid_to_solid
    {
        type            noSlip;
    }
}

// ************************************************************************* //
