openfoam_templates/microchannel/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform __BASE_TEMP__;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    solidBottom
    {
        type            fixedGradient;
        gradient        uniform __HEAT_FLUX_GRADIENT__;
        value           uniform __BASE_TEMP__;
    }
    solidExternal
    {
        type            zeroGradient;
    }
    solid_to_fluid
    {
        type            coupledTemperature;
        value           $internalField;
    }
}

// ************************************************************************* //
