openfoam_templates/microchannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;

vertices
(
    (0 0 -50)
    (1000 0 -50)
    (1000 100 -50)
    (0 100 -50)
    (0 0 0)
    (1000 0 0)
    (1000 100 0)
    (0 100 0)
    (0 0 500)
    (1000 0 500)
    (1000 100 500)
    (0 100 500)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) solid (50 10 5) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) fluid (50 10 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fluidInlet
    {
        type patch;
        faces
        (
            (4 7 11 8)
        );
    }
    fluidOutlet
    {
        type patch;
        faces
        (
            (5 9 10 6)
        );
    }
    fluidWalls
    {
        type wall;
        faces
        (
            (8 11 10 9)
            (4 8 9 5)
            (7 6 10 11)
        );
    }
    solidBottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    solidExternal
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
            (0 3 7 4)
            (1 5 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
